Revit 2024 API
RepeaterBounds Methods
The RepeaterBounds type exposes the following members.
Methods
Name | Description
AdjustForCyclicalBounds
 Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
AreCoordinatesInBounds
 Determines whether given coordinates are within the bounds.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLowerBound
 Returns the smallest index of the array in the given dimension.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUpperBound
 Returns the highest index of the array in the given dimension.
IsCyclical
 True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RepeaterBounds Class
Autodesk.Revit.DB Namespace